
Press RETURN to get started!



Router>
Router>enable
Router#erase startup-config
Erasing the nvram filesystem will remove all configuration files! Continue? [confirm]
[OK]
Erase of nvram: complete
%SYS-7-NV_BLOCK_INIT: Initialized the geometry of nvram
Router#reload
Proceed with reload? [confirm]
System Bootstrap, Version 12.3(8r)T8, RELEASE SOFTWARE (fc1)
Initializing memory for ECC
..
C1841 processor with 524288 Kbytes of main memory
Main memory is configured to 64 bit mode with ECC enabled

Readonly ROMMON initialized

Self decompressing the image :
########################################################################## [OK]
              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, 1841 Software (C1841-IPBASE-M), Version 12.3(14)T7, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2006 by Cisco Systems, Inc.
Compiled Mon 15-May-06 14:54 by pt_team
Image text-base: 0x6007D180, data-base: 0x61400000

Port Statistics for unclassified packets is not turned on.
Cisco 1841 (revision 5.0) with 114688K/16384K bytes of memory.
Processor board ID FTX0947Z18E
M860 processor: part number 0, mask 49
2 FastEthernet/IEEE 802.3 interface(s)
2 Low-speed serial(sync/async) network interface(s)
191K bytes of NVRAM.
32768K bytes of ATA CompactFlash (Read/Write)
Cisco IOS Software, 1841 Software (C1841-IPBASE-M), Version 12.3(14)T7, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2006 by Cisco Systems, Inc.
Compiled Mon 15-May-06 14:54 by pt_team


         --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: no 


Press RETURN to get started!



Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
R1(config)#no hostname
Router(config)#hostname r1
r1(config)#no ip domain-lookup
r1(config)#enable password cisco
r1(config)#show run
            ^
% Invalid input detected at '^' marker.
	
r1(config)#en
% Ambiguous command: "en"
r1(config)#showrun
            ^
% Invalid input detected at '^' marker.
	
r1(config)#en
% Ambiguous command: "en"
r1(config)#enable secret class
r1(config)#en
% Ambiguous command: "en"
r1(config)#end\
              
% Invalid input detected at '^' marker.
	
r1(config)#end
r1#
%SYS-5-CONFIG_I: Configured from console by console

r1#exit









r1 con0 is now available






Press RETURN to get started.













r1>en
Password: 
Password: 
r1#config
Configuring from terminal, memory, or network [terminal]? conf t
?Must be "terminal", "memory" or "network"
r1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
r1(config)#banner motd &
Enter TEXT message.  End with the character '&'.

&

r1(config)#&
           ^
% Invalid input detected at '^' marker.
	
r1(config)#banner motd &
Enter TEXT message.  End with the character '&'.
&

r1(config)#&
           ^
% Invalid input detected at '^' marker.
	
r1(config)#banner motd & 
Enter TEXT message.  End with the character '&'.
******************************** 
 !!!AUTHORIZED ACCESS ONLY!!! 
******************************** 
& 

r1(config)#&
           ^
% Invalid input detected at '^' marker.
	
r1(config)#banner motd &
Enter TEXT message.  End with the character '&'.
******************************** 
 !!!AUTHORIZED ACCESS ONLY!!! 
******************************** 

&

r1(config)#en
% Ambiguous command: "en"
r1(config)#conf t 
%Invalid hex value
r1(config)#
r1(config)#line console 0
r1(config-line)#password cisco
r1(config-line)#login
r1(config-line)#exit
r1(config)#
r1(config)#line vty 0 4 
r1(config-line)#password cisco
r1(config-line)#login
r1(config-line)#exit
r1(config)#interface fastethernet 0/0
r1(config-if)#ip address 192.168.1.1 255.255.255.0
r1(config-if)#no shutdown

r1(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

r1#
%SYS-5-CONFIG_I: Configured from console by console

r1#


Router> en
Router#
Router#erase startup-config
Router#
Router#reload
Router#configure terminal
Router(config)#
Router(config)#hostname R2
R2(config)#
R2(config)#no ip domain-lookup
R2(config)#
R2(config)#enable secret class
R2(config)#
R2(config)#banner motd &
